In [1]:
from pandas import Series,DataFrame
import pandas as pd
import numpy as np
from numpy import NaN as NA

In [3]:
data = DataFrame({'k1':['one']*3+['two']*4,'k2':[1,1,2,3,3,4,4]})
data

    k1  k2
0  one   1
1  one   1
2  one   2
3  two   3
4  two   3
5  two   4
6  two   4

In [5]:
# 检查dataframe的每一行是否为重复的行数据
mask = data.duplicated()
mask

0    False
1     True
2    False
3    False
4     True
5    False
6     True
dtype: bool

In [7]:
data[~mask] # a通过花式索引去除重复的行数据

    k1  k2
0  one   1
2  one   2
3  two   3
5  two   4

In [9]:
data.drop_duplicates() # 找到重复行并进行删除

    k1  k2
0  one   1
2  one   2
3  two   3
5  two   4

In [10]:
data['v1'] = range(7)

In [11]:
data

    k1  k2  v1
0  one   1   0
1  one   1   1
2  one   2   2
3  two   3   3
4  two   3   4
5  two   4   5
6  two   4   6

In [12]:
data.drop_duplicates('k1') # 指定只看‘k1’如果k1重复就删除 ,默认的keep='first'

    k1  k2  v1
0  one   1   0
3  two   3   3

In [13]:
# 通过keep参数指定需要保留的重复数据
data.drop_duplicates('k1',keep='last')

    k1  k2  v1
2  one   2   2
6  two   4   6

In [15]:
# 只要有重复就删除，舍弃
data.drop_duplicates('k1',keep=(False))

Empty DataFrame
Columns: [k1, k2, v1]
Index: []

In [19]:
data=DataFrame({'food':['bacon','pulled pork','bacon','Pastrami',
                       'corned beef','Bacon','pastrami','honey ham','nova lox'],
               'ounces':[4,3,12,6,7.5,8,3,5,6]})
meat_to_animal={
    'bacon':'pig',
    'pulled pork':'pig',
    'pastrami':'cow',
    'honey ham':'pig',
    'nova lox':'salmon',
    'corned beef':'cow'
}
data

          food  ounces
0        bacon     4.0
1  pulled pork     3.0
2        bacon    12.0
3     Pastrami     6.0
4  corned beef     7.5
5        Bacon     8.0
6     pastrami     3.0
7    honey ham     5.0
8     nova lox     6.0

In [20]:
data['animal'] = data['food'].map(str.lower).map(meat_to_animal) # 简单的映射

In [21]:
data

          food  ounces  animal
0        bacon     4.0     pig
1  pulled pork     3.0     pig
2        bacon    12.0     pig
3     Pastrami     6.0     cow
4  corned beef     7.5     cow
5        Bacon     8.0     pig
6     pastrami     3.0     cow
7    honey ham     5.0     pig
8     nova lox     6.0  salmon

In [23]:
data['food'].map(str.lower).map(meat_to_animal)

0       pig
1       pig
2       pig
3       cow
4       cow
5       pig
6       cow
7       pig
8    salmon
Name: food, dtype: object

In [27]:
# 
data['food'].map(lambda x:meat_to_animal[x.lower()])

0       pig
1       pig
2       pig
3       cow
4       cow
5       pig
6       cow
7       pig
8    salmon
Name: food, dtype: object